# - *- coding: utf- 8 - *-

data = [
    (
        'Institutional environment', [
            {
                'id': 1,
                'question': u'هل تتمتع المعلومات بالقدرة على تحسين الخدمات أو تقديم الخدمات؟'
            },
            {
                'id': 2,
                'question': u'''تتوافق البيانات مع إطار جودة البيانات ، بما في ذلك:

* التشريع
* سياسات
* إدارة الأصول المعلومات
* المعايير
* خطط إدارة البيانات'''
            },
            {
                'id': 3,
                'question': u'''يتم تعيين أدوار ومسؤوليات الحوكمة التالية لهذا الأصل بوضوح:

* مالك الأصول المعلومات
* معلومات الأصول الحافظ
* معلومات ستيوارد'''
            },
            {
                'id': 4,
                'question': u'جمع البيانات مصرح به بموجب القانون أو اللوائح أو الاتفاقية'
            },
            {
                'id': 5,
                'question': u'''ليس لدى وكالة الحفظ أي مصلحة تجارية أو تضارب في المصالح في البيانات'''
            },
        ]
    ),
    (
        'Accuracy', [
            {
                'id': 6,
                'question': u'تخضع البيانات لعملية ضمان البيانات'
            },
            {
                'id': 7,
                'question': u'تتم مراجعة البيانات وتنشر المراجعة إذا تم تحديد الأخطاء'
            },
            {
                'id': 8,
                'question': u'لا توجد فجوات معروفة في البيانات أو إذا كانت هناك فجوات ، فقد تم تحديدها في التحذيرات المرفقة بمجموعة البيانات.'
            },
            {
                'id': 9,
                'question': u'لم يتم إجراء أي تغييرات أو تحديد عوامل أخرى (على سبيل المثال: الترجيح ، التقريب ، إلغاء تحديد البيانات ، التغييرات أو العيوب في جمع البيانات أو طرق التحقق) التي يمكن أن تؤثر على صحة البيانات ؛ أو أي تغييرات / عوامل تم تحديدها في التحذيرات المرتبطة بالأصل.'
            },
            {
                'id': 10,
                'question': u'حققت مجموعة البيانات أهداف المستخدم الأساسي. تمثل البيانات بشكل صحيح ما تم تصميمه لقياسه أو مراقبته أو تقريره.'
            },
        ]
    ),
    (
        'Coherence', [
            {
                'id': 11,
                'question': u'هل تتمتع المعلومات بالقدرة على تحسين الخدمات أو تقديم الخدمات؟'
            },
            {
                'id': 12,
                'question': u'''تتوافق البيانات مع إطار جودة البيانات ، بما في ذلك:

* التشريع
* سياسات
* إدارة الأصول المعلومات
* المعايير
* خطط إدارة البيانات'''
            },
            {
                'id': 13,
                'question': u'''يتم تعيين أدوار ومسؤوليات الحوكمة التالية لهذا الأصل بوضوح:

* مالك الأصول المعلومات
* معلومات الأصول الحافظ
* معلومات ستيوارد'''
            },
            {
                'id': 14,
                'question': u'جمع البيانات مصرح به بموجب القانون أو اللوائح أو الاتفاقية'
            },
            {
                'id': 15,
                'question': u'''ليس لدى وكالة الحفظ أي مصلحة تجارية أو تضارب في المصالح في البيانات'''
            },
        ]
    ),
    (
        'Interpretability', [
            {
                'id': 16,
                'question': u'تخضع البيانات لعملية ضمان البيانات'
            },
            {
                'id': 17,
                'question': u'تتم مراجعة البيانات وتنشر المراجعة إذا تم تحديد الأخطاء'
            },
            {
                'id': 18,
                'question': u'لا توجد فجوات معروفة في البيانات أو إذا كانت هناك فجوات ، فقد تم تحديدها في التحذيرات المرفقة بمجموعة البيانات.'
            },
            {
                'id': 19,
                'question': u'لم يتم إجراء أي تغييرات أو تحديد عوامل أخرى (على سبيل المثال: الترجيح ، التقريب ، إلغاء تحديد البيانات ، التغييرات أو العيوب في جمع البيانات أو طرق التحقق) التي يمكن أن تؤثر على صحة البيانات ؛ أو أي تغييرات / عوامل تم تحديدها في التحذيرات المرتبطة بالأصل.'
            },
            {
                'id': 20,
                'question': u'حققت مجموعة البيانات أهداف المستخدم الأساسي. تمثل البيانات بشكل صحيح ما تم تصميمه لقياسه أو مراقبته أو تقريره.'
            },
        ]
    ),
    (
        'Accessibility', [
             {
                'id': 21,
                'question': u'تخضع البيانات لعملية ضمان البيانات'
            },
            {
                'id': 22,
                'question': u'تتم مراجعة البيانات وتنشر المراجعة إذا تم تحديد الأخطاء'
            },
            {
                'id': 23,
                'question': u'لا توجد فجوات معروفة في البيانات أو إذا كانت هناك فجوات ، فقد تم تحديدها في التحذيرات المرفقة بمجموعة البيانات.'
            },
            {
                'id': 24,
                'question': u'لم يتم إجراء أي تغييرات أو تحديد عوامل أخرى (على سبيل المثال: الترجيح ، التقريب ، إلغاء تحديد البيانات ، التغييرات أو العيوب في جمع البيانات أو طرق التحقق) التي يمكن أن تؤثر على صحة البيانات ؛ أو أي تغييرات / عوامل تم تحديدها في التحذيرات المرتبطة بالأصل.'
            },
            {
                'id': 25,
                'question': u'حققت مجموعة البيانات أهداف المستخدم الأساسي. تمثل البيانات بشكل صحيح ما تم تصميمه لقياسه أو مراقبته أو تقريره.'
            },
        ]
    ),
]
